In [0]:
# Importando o pandas e o leitor de url
import pandas as pd
import io
import requests

In [0]:
# Lendo a url do arquivo csv
url = "https://raw.githubusercontent.com/BuzzFeedNews/zika-data/master/data/parsed/brazil/brazil-microcephaly-2016-01-23-table-1.csv"
df = pd.read_csv(url, sep=',')

In [3]:
df.head()

   no     state  ... cases_discarded cases_reported_total
0   1   Alagoas  ...               0                  158
1   2     Bahia  ...              27                  533
2   3     Ceará  ...               7                  229
3   4  Maranhão  ...              15                  134
4   5   Paraíba  ...             181                  709

[5 rows x 6 columns]

In [0]:
# Utilizarei o .head() para facilitar a vizualização do DataFrame

In [0]:
# Selecionando 01 coluna pelo índice
df["state"].head()

0     Alagoas
1       Bahia
2       Ceará
3    Maranhão
4     Paraíba
Name: state, dtype: object

In [0]:
# Selecionando n colunas pelo índice
df[["state","cases_under_investigation","cases_reported_total"]].head()

      state cases_under_investigation cases_reported_total
0   Alagoas                       158                  158
1     Bahia                       471                  533
2     Ceará                       218                  229
3  Maranhão                       119                  134
4   Paraíba                       497                  709

In [0]:
# Selecionando a coluna pela notação de ponto
df.state.head()

0     Alagoas
1       Bahia
2       Ceará
3    Maranhão
4     Paraíba
Name: state, dtype: object

In [0]:
# Adicionando uma nova coluna com dados de duas colunas existentes
df["nova_coluna"] = df["state"] + " " + df["cases_reported_total"]

In [0]:
df.head()

,no,state,cases_under_investigation,cases_confirmed,cases_discarded,cases_reported_total,nova_coluna
0,1,Alagoas,158,0,0,158,Alagoas 158
1,2,Bahia,471,35,27,533,Bahia 533
2,3,Ceará,218,4,7,229,Ceará 229
3,4,Maranhão,119,0,15,134,Maranhão 134
4,5,Paraíba,497,31,181,709,Paraíba 709

In [0]:
# Excluindo colunas pelo argumento axis = 1
df.drop("no",axis=1).head()

,state,cases_under_investigation,cases_confirmed,cases_discarded,cases_reported_total,nova_coluna
0,Alagoas,158,0,0,158,Alagoas 158
1,Bahia,471,35,27,533,Bahia 533
2,Ceará,218,4,7,229,Ceará 229
3,Maranhão,119,0,15,134,Maranhão 134
4,Paraíba,497,31,181,709,Paraíba 709

In [0]:
# Excluindo linhas por index
df.drop([0,1]).head()

,no,state,cases_under_investigation,cases_confirmed,cases_discarded,cases_reported_total,nova_coluna
2,3,Ceará,218,4,7,229,Ceará 229
3,4,Maranhão,119,0,15,134,Maranhão 134
4,5,Paraíba,497,31,181,709,Paraíba 709
5,6,Pernambuco,1125,138,110,1373,Pernambuco 1373
6,7,Piauí,91,0,0,91,Piauí 91